<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1b831a401352fedad8c583677aabcfada0460e69ab6f69066e2e8eae8da5c769","plan_job_ref":"Job Terraform plan #38 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8133030546","plan_out_hash":"e913e8b255acccd94cc49e7e0b644d87bb599820da9059bb67095b6733f70fdb","plan_hash":"fcf20d062b80a2c518d3a7d730cb96bb36a0b55e375484ee8e1937c2eb226f6d","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
folder_id           = "b1gs3v5tpo5eo8em8ph4"
```
</details>
<details>
<summary>Plan: 3 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                = "d4ef136o48bqjg3sv4q7"
        name              = "receive-video-handler"
        tags              = []
!~      user_hash         = "d2689c4ce910f6e575f0a8d3510623395e0b56bad1e721a13577d377c26aaf84" -> "884a7062281b69649612df48a99aa3ac75450632ce091c78226b33efedd71e1b"
#        (10 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_function_trigger.receive-video-handler-trigger will be created
+   resource "yandex_function_trigger" "receive-video-handler-trigger" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "receive-video-handler-trigger"

+       function {
+           id = "d4ef136o48bqjg3sv4q7"
        }

+       message_queue {
+           batch_cutoff       = "0"
+           batch_size         = "1"
+           queue_id           = "***********************************************************************"
+           service_account_id = "********************"
        }
    }

  # yandex_resourcemanager_folder_iam_member.receive-video-handler-function-trigger-invoker will be created
+   resource "yandex_resourcemanager_folder_iam_member" "receive-video-handler-function-trigger-invoker" {
+       folder_id = "********************"
+       id        = (known after apply)
+       member    = "serviceAccount:ajerhcrvvpk6nm82uh1o"
+       role      = "functions.functionInvoker"
    }

  # yandex_resourcemanager_folder_iam_member.receive-video-handler-trigger-editor will be created
+   resource "yandex_resourcemanager_folder_iam_member" "receive-video-handler-trigger-editor" {
+       folder_id = "********************"
+       id        = (known after apply)
+       member    = "serviceAccount:ajerhcrvvpk6nm82uh1o"
+       role      = "editor"
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #22](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8133039237)